cases/incompressible/displacementSBRStress/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

amp #calc"degToRad(45)";

dynamicFvMesh      dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver    displacementSBRStress; //displacementLaplacian

//diffusivity       quadratic inversePointDistance (aerofoil);

//diffusivity       exponential 30 inversePointDistance (aerofoil);

diffusivity       inverseDistance (aerofoil);

// ************************************************************************* //
