cases/incompressible/displacementSBRStress/system/functions/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    For specified fields, writes out the initial residuals for the first
    solution of each time step; for non-scalar fields (e.g. vectors), writes
    the largest of the residuals for each component (e.g. x, y, z).

\*---------------------------------------------------------------------------*/

#include "./initialConditions"

residuals
{
     type            residuals;
     libs            ("libutilityFunctionObjects.so");

     writeControl    adjustableRunTime;
     writeInterval   $writeEvery;

     fields (p U e k omega nuTilda);
}
// ************************************************************************* //
